In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame([[1,2,4,5],[43,5,34,4],[23,3,34,6],[23,55,65,23],[23,56,2,3],[12,43,54,12]], columns=["A", "B", "C", "D"])

In [6]:
df

    A   B   C   D
0   1   2   4   5
1  43   5  34   4
2  23   3  34   6
3  23  55  65  23
4  23  56   2   3
5  12  43  54  12

In [7]:
df.head()

    A   B   C   D
0   1   2   4   5
1  43   5  34   4
2  23   3  34   6
3  23  55  65  23
4  23  56   2   3

In [11]:
df.to_csv('export.csv', index=False)